{
  "qualityUpdatesPauseStartDate": null,
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "engagedRestartSnoozeScheduleInDays": null,
  "featureUpdatesWillBeRolledBack": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "userPauseAccess": "disabled",
  "skipChecksBeforeRestart": false,
  "version": 1,
  "roleScopeTagIds": [
    "0"
  ],
  "qualityUpdatesWillBeRolledBack": null,
  "businessReadyUpdatesOnly": "userDefined",
  "postponeRebootUntilAfterDeadline": null,
  "name": "CIPP: Default Update Ring",
  "qualityUpdatesPaused": false,
  "engagedRestartDeadlineInDays": null,
  "autoRestartNotificationDismissal": "notConfigured",
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "engagedRestartTransitionScheduleInDays": null,
  "qualityUpdatesDeferralPeriodInDays": 7,
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "updateWeeks": "everyWeek",
  "featureUpdatesPauseStartDate": null,
  "featureUpdatesPaused": false,
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "prereleaseFeatures": "userDefined",
  "updateNotificationLevel": "restartWarningsOnly",
  "deviceManagementApplicabilityRuleOsEdition": null,
  "userWindowsUpdateScanAccess": "disabled",
  "scheduleRestartWarningInHours": null,
  "driversExcluded": false,
  "automaticUpdateMode": "autoInstallAndRebootAtScheduledTime",
  "deadlineGracePeriodInDays": null,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackWindowInDays": 30,
  "featureUpdatesDeferralPeriodInDays": 14,
  "allowWindows11Upgrade": false,
  "installationSchedule": {
    "scheduledInstallTime": "03:00:00.0000000",
    "scheduledInstallDay": "saturday",
    "@odata.type": "#microsoft.graph.windowsUpdateScheduledInstall"
  },
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "deadlineForQualityUpdatesInDays": null,
  "deadlineForFeatureUpdatesInDays": null,
  "scheduleImminentRestartWarningInMinutes": null,
  "deliveryOptimizationMode": "userDefined",
  "microsoftUpdateServiceAllowed": true,
  "displayName": "CIPP: Default Update Ring",
  "description": "Bezalu's curated Windows Update settings",
  "Type": "Device",
  "GUID": "42315faa-214d-4532-80df-0fe34350d4ee"
}
